Билет11/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ТоварыОтгружены</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыПриняты</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>СуммаПоДокументуОтгружено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументуПринято</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтгружено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОтгружено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПринято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет11/src/AccumulationRegisters/ТоварыОтгружены/ТоварыОтгружены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыОтгружены</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоОтгружено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СебестоимостьОтгруженых</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет11/src/AccumulationRegisters/ТоварыПриняты/ТоварыПриняты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыПриняты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоПринято</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СебестоимостьПринятых</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет11/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет11/src/Documents/РасходнаяНакладная/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаПоДокументуОтгружено = СписокНоменклатуры.Итог("СуммаОтгружено");
	СуммаПоДокументуПринято = СписокНоменклатуры.Итог("СуммаПринято");
	
	Для каждого СтрокаТЧ Из СписокНоменклатуры Цикл
	
		Если строкаТЧ.КоличествоОтгружено < СтрокаТЧ.КоличествоПринято Тогда
		      Отказ = Истина;
			  Сообщение = Новый СообщениеПользователю;
			  Сообщение.Текст = "принято больше отгружено!";
			  Сообщение.Сообщить();
			
		
		КонецЕсли;
	
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ТоварыОтгружены.Записывать = Истина;
	Движения.ТоварыПриняты.Записывать = Истина;
    Движения.Взаиморасчеты.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.КоличествоОтгружено) КАК КоличествоОтгружено,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.КоличествоПринято) КАК КоличествоПринято,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.СуммаОтгружено) КАК СебестоимостьОтгруженых,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.СуммаПринято) КАК СебестоимостьПринятых,
		|	&Период КАК Период,
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка КАК Накладная,
		|	РасходнаяНакладнаяСписокНоменклатуры.СуммаПринято КАК СуммаКОплате
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура,
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка,
		|	РасходнаяНакладнаяСписокНоменклатуры.СуммаПринято";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ТоварыОтгружены.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);

		Движение = Движения.ТоварыПриняты.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
		Движение = Движения.Взаиморасчеты.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры
